# SetSystemType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Duct..::..SetSystemType Method
Duct Class See Also
---
Updates the associated system type for the duct.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetSystemType(
	ElementId systemTypeId
)
```

Visual Basic
---
```text
Public Sub SetSystemType ( _
	systemTypeId As ElementId _
)
```

Visual C++
---
```text
public:
void SetSystemType(
	ElementId^ systemTypeId
)
```

# ### Parameters
systemTypeId
    Type: Autodesk.Revit.DB..::..ElementId The ElementId of the hvac system type.
# Remarks
If the duct previously did not have a system associated to it, this will create a new system.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The systemTypeId is not valid HVAC system type. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
Duct Class
Autodesk.Revit.DB.Mechanical Namespace